package by.it.sc04_evening_tue_thu.krasikova.lesson05;

/*
Вывести таблицу умножения 10 x 10 (двоныйм циклом),
но вывод должен быть словами:

Ожидаемый вывод:
два умножить на два равно четыре
два умножить на три равно шесть
два умножить на четыре равно восемь
два умножить на пять равно десять
два умножить на шесть равно двенадцать
два умножить на семь равно четырнадцать
два умножить на восемь равно шестнадцать
два умножить на девять равно восемнадцать
два умножить на десять равно двадцать
три умножить на два равно шесть
три умножить на три равно девять
три умножить на четыре равно двенадцать
...
и т.д. до фразы
...
десять умножить на десять равно сто
*/

public class TaskC3 {
    public static void main (String args []) {
        for (int e=1; e<=10; e++) {
                String x=new String ("два");
                switch (e) {
                    case 1:
                        String y=("два");
                        String z= ("четыре");
                        System.out.println(x+" умножить на "+y+" равно "+z+" ");
                        break;
                    case 2:
                        String a=("три");
                        String b=("шесть");
                        System.out.println(x+" умножить на "+a+" равно "+b+" ");
                        break;
                    case 3:
                        String c=("четыре");
                        String d= ("восемь");
                        System.out.println(x+" умножить на "+c+" равно "+d+" ");
                        break;
                    case 4:
                        String g=("пять");
                        String f= ("десять");
                        System.out.println(x+" умножить на "+g+" равно "+f+" ");
                        break;
                    case 5:
                        String k=("шесть");
                        String l= ("двенадцать");
                        System.out.println(x+" умножить на "+k+" равно "+l+" ");
                        break;
                    case 6:
                        String m=("семь");
                        String n= ("четырнадцать");
                        System.out.println(x+" умножить на "+m+" равно "+n+" ");
                        break;
                    case 7:
                        String o=("восемь");
                        String p= ("шестнадцать");
                        System.out.println(x+" умножить на "+o+" равно "+p+" ");
                        break;
                    case 8:
                        String r=("девять");
                        String s= ("восемнадцать");
                        System.out.println(x+" умножить на "+r+" равно "+s+" ");
                        break;
                    case 9:
                        String t=("десять");
                        String u= ("двадцать");
                        System.out.println(x+" умножить на "+t+" равно "+u+" ");
                        break;
                }

            }
        for (int e=1; e<=10; e++) {
            String x= ("три");
            switch (e) {
                case 1:
                    String y=("два");
                    String z= ("шесть");
                    System.out.println(x+" умножить на "+y+" равно "+z+" ");
                    break;
                case 2:
                    String a=("три");
                    String b=("девять");
                    System.out.println(x+" умножить на "+a+" равно "+b+" ");
                    break;
                case 3:
                    String g=("четыре");
                    String f= ("двенадцать");
                    System.out.println(x+" умножить на "+g+" равно "+f+" ");
                    break;
                case 4:
                    String k=("пять");
                    String l= ("пятнадцать");
                    System.out.println(x+" умножить на "+k+" равно "+l+" ");
                    break;
                case 5:
                    String m=("шесть");
                    String n= ("восемнадцать");
                    System.out.println(x+" умножить на "+m+" равно "+n+" ");
                    break;
                case 6:
                    String o=("семь");
                    String p= ("двадцать один");
                    System.out.println(x+" умножить на "+o+" равно "+p+" ");
                    break;
                case 7:
                    String r=("восемь");
                    String s= ("двадцать четыре");
                    System.out.println(x+" умножить на "+r+" равно "+s+" ");
                    break;
                case 8:
                    String t=("девять");
                    String u= ("двадцать семь");
                    System.out.println(x+" умножить на "+t+" равно "+u+" ");
                    break;
                case 9:
                    String t1=("десять");
                    String u1= ("тридцать");
                    System.out.println(x+" умножить на "+t1+" равно "+u1+" ");
                    break;
            }

        } for (int e=1; e<=10; e++) {
            String x= ("четыре");
            switch (e) {
                case 1:
                    String y=("два");
                    String z= ("восемь");
                    System.out.println(x+" умножить на "+y+" равно "+z+" ");
                    break;
                case 2:
                    String a=("три");
                    String b=("двенадцать");
                    System.out.println(x+" умножить на "+a+" равно "+b+" ");
                    break;
                case 3:
                    String g=("четыре");
                    String f= ("шестнадцать");
                    System.out.println(x+" умножить на "+g+" равно "+f+" ");
                    break;
                case 4:
                    String k=("пять");
                    String l= ("двадцать");
                    System.out.println(x+" умножить на "+k+" равно "+l+" ");
                    break;
                case 5:
                    String m=("шесть");
                    String n= ("двадцать четыре");
                    System.out.println(x+" умножить на "+m+" равно "+n+" ");
                    break;
                case 6:
                    String o=("семь");
                    String p= ("двадцать восемь");
                    System.out.println(x+" умножить на "+o+" равно "+p+" ");
                    break;
                case 7:
                    String r=("восемь");
                    String s= ("тридцать два");
                    System.out.println(x+" умножить на "+r+" равно "+s+" ");
                    break;
                case 8:
                    String t=("девять");
                    String u= ("тридцать шесть");
                    System.out.println(x+" умножить на "+t+" равно "+u+" ");
                    break;
                case 9:
                    String t1=("десять");
                    String u1= ("сорок");
                    System.out.println(x+" умножить на "+t1+" равно "+u1+" ");
                    break;
            }

        } for (int e=1; e<=10; e++) {
            String x= ("пять");
            switch (e) {
                case 1:
                    String y=("два");
                    String z= ("десять");
                    System.out.println(x+" умножить на "+y+" равно "+z+" ");
                    break;
                case 2:
                    String a=("три");
                    String b=("пятнадцать");
                    System.out.println(x+" умножить на "+a+" равно "+b+" ");
                    break;
                case 3:
                    String g=("четыре");
                    String f= ("двадцать");
                    System.out.println(x+" умножить на "+g+" равно "+f+" ");
                    break;
                case 4:
                    String k=("пять");
                    String l= ("двадцать пять");
                    System.out.println(x+" умножить на "+k+" равно "+l+" ");
                    break;
                case 5:
                    String m=("шесть");
                    String n= ("тридцать");
                    System.out.println(x+" умножить на "+m+" равно "+n+" ");
                    break;
                case 6:
                    String o=("семь");
                    String p= ("тридцать пять");
                    System.out.println(x+" умножить на "+o+" равно "+p+" ");
                    break;
                case 7:
                    String r=("восемь");
                    String s= ("сорок");
                    System.out.println(x+" умножить на "+r+" равно "+s+" ");
                    break;
                case 8:
                    String t=("девять");
                    String u= ("сорок пять");
                    System.out.println(x+" умножить на "+t+" равно "+u+" ");
                    break;
                case 9:
                    String t1=("десять");
                    String u1= ("пятьдесят");
                    System.out.println(x+" умножить на "+t1+" равно "+u1+" ");
                    break;
            }

        } for (int e=1; e<=10; e++) {
            String x= ("шесть");
            switch (e) {
                case 1:
                    String y=("два");
                    String z= ("двенадцать");
                    System.out.println(x+" умножить на "+y+" равно "+z+" ");
                    break;
                case 2:
                    String a=("три");
                    String b=("восемнадцать");
                    System.out.println(x+" умножить на "+a+" равно "+b+" ");
                    break;
                case 3:
                    String g=("четыре");
                    String f= ("двадцать четыре");
                    System.out.println(x+" умножить на "+g+" равно "+f+" ");
                    break;
                case 4:
                    String k=("пять");
                    String l= ("тридцать");
                    System.out.println(x+" умножить на "+k+" равно "+l+" ");
                    break;
                case 5:
                    String m=("шесть");
                    String n= ("тридцать шесть");
                    System.out.println(x+" умножить на "+m+" равно "+n+" ");
                    break;
                case 6:
                    String o=("семь");
                    String p= ("сорок два");
                    System.out.println(x+" умножить на "+o+" равно "+p+" ");
                    break;
                case 7:
                    String r=("восемь");
                    String s= ("сорок восемь");
                    System.out.println(x+" умножить на "+r+" равно "+s+" ");
                    break;
                case 8:
                    String t=("девять");
                    String u= ("пятьдесят четыре");
                    System.out.println(x+" умножить на "+t+" равно "+u+" ");
                    break;
                case 9:
                    String t1=("десять");
                    String u1= ("шестьдесят");
                    System.out.println(x+" умножить на "+t1+" равно "+u1+" ");
                    break;
            }

        } for (int e=1; e<=10; e++) {
            String x= ("семь");
            switch (e) {
                case 1:
                    String y=("два");
                    String z= ("четырнадцать");
                    System.out.println(x+" умножить на "+y+" равно "+z+" ");
                    break;
                case 2:
                    String a=("три");
                    String b=("двадцать один");
                    System.out.println(x+" умножить на "+a+" равно "+b+" ");
                    break;
                case 3:
                    String g=("четыре");
                    String f= ("двадцать восемь");
                    System.out.println(x+" умножить на "+g+" равно "+f+" ");
                    break;
                case 4:
                    String k=("пять");
                    String l= ("тридцать пять");
                    System.out.println(x+" умножить на "+k+" равно "+l+" ");
                    break;
                case 5:
                    String m=("шесть");
                    String n= ("сорок два");
                    System.out.println(x+" умножить на "+m+" равно "+n+" ");
                    break;
                case 6:
                    String o=("семь");
                    String p= ("сорок девять");
                    System.out.println(x+" умножить на "+o+" равно "+p+" ");
                    break;
                case 7:
                    String r=("восемь");
                    String s= ("пятьдесят шесть");
                    System.out.println(x+" умножить на "+r+" равно "+s+" ");
                    break;
                case 8:
                    String t=("девять");
                    String u= ("шестьдесят три");
                    System.out.println(x+" умножить на "+t+" равно "+u+" ");
                    break;
                case 9:
                    String t1=("десять");
                    String u1= ("семьдесят");
                    System.out.println(x+" умножить на "+t1+" равно "+u1+" ");
                    break;
            }

        } for (int e=1; e<=10; e++) {
            String x= ("восемь");
            switch (e) {
                case 1:
                    String y=("два");
                    String z= ("шестнадцать");
                    System.out.println(x+" умножить на "+y+" равно "+z+" ");
                    break;
                case 2:
                    String a=("три");
                    String b=("двадцать четыре");
                    System.out.println(x+" умножить на "+a+" равно "+b+" ");
                    break;
                case 3:
                    String g=("четыре");
                    String f= ("тридцать два");
                    System.out.println(x+" умножить на "+g+" равно "+f+" ");
                    break;
                case 4:
                    String k=("пять");
                    String l= ("сорок");
                    System.out.println(x+" умножить на "+k+" равно "+l+" ");
                    break;
                case 5:
                    String m=("шесть");
                    String n= ("сорок восемь");
                    System.out.println(x+" умножить на "+m+" равно "+n+" ");
                    break;
                case 6:
                    String o=("семь");
                    String p= ("пятьдесят шесть");
                    System.out.println(x+" умножить на "+o+" равно "+p+" ");
                    break;
                case 7:
                    String r=("восемь");
                    String s= ("шестьдесят четыре");
                    System.out.println(x+" умножить на "+r+" равно "+s+" ");
                    break;
                case 8:
                    String t=("девять");
                    String u= ("семьдесят два");
                    System.out.println(x+" умножить на "+t+" равно "+u+" ");
                    break;
                case 9:
                    String t1=("десять");
                    String u1= ("восемьдесят");
                    System.out.println(x+" умножить на "+t1+" равно "+u1+" ");
                    break;
            }

        } for (int e=1; e<=10; e++) {
            String x= ("девять");
            switch (e) {
                case 1:
                    String y=("два");
                    String z= ("восемнадцать");
                    System.out.println(x+" умножить на "+y+" равно "+z+" ");
                    break;
                case 2:
                    String a=("три");
                    String b=("двадцать семь");
                    System.out.println(x+" умножить на "+a+" равно "+b+" ");
                    break;
                case 3:
                    String g=("четыре");
                    String f= ("тридцать шесть");
                    System.out.println(x+" умножить на "+g+" равно "+f+" ");
                    break;
                case 4:
                    String k=("пять");
                    String l= ("сорок пять");
                    System.out.println(x+" умножить на "+k+" равно "+l+" ");
                    break;
                case 5:
                    String m=("шесть");
                    String n= ("пятьдесят четыре");
                    System.out.println(x+" умножить на "+m+" равно "+n+" ");
                    break;
                case 6:
                    String o=("семь");
                    String p= ("шестьдесят три");
                    System.out.println(x+" умножить на "+o+" равно "+p+" ");
                    break;
                case 7:
                    String r=("восемь");
                    String s= ("семьдесят два");
                    System.out.println(x+" умножить на "+r+" равно "+s+" ");
                    break;
                case 8:
                    String t=("девять");
                    String u= ("восемьдесят один");
                    System.out.println(x+" умножить на "+t+" равно "+u+" ");
                    break;
                case 9:
                    String t1=("десять");
                    String u1= ("девяносто");
                    System.out.println(x+" умножить на "+t1+" равно "+u1+" ");
                    break;
            }

        } for (int e=1; e<=10; e++) {
            String x= ("десять");
            switch (e) {
                case 1:
                    String y=("два");
                    String z= ("двадцать");
                    System.out.println(x+" умножить на "+y+" равно "+z+" ");
                    break;
                case 2:
                    String a=("три");
                    String b=("тридцать");
                    System.out.println(x+" умножить на "+a+" равно "+b+" ");
                    break;
                case 3:
                    String g=("четыре");
                    String f= ("сорок");
                    System.out.println(x+" умножить на "+g+" равно "+f+" ");
                    break;
                case 4:
                    String k=("пять");
                    String l= ("пятьдесят");
                    System.out.println(x+" умножить на "+k+" равно "+l+" ");
                    break;
                case 5:
                    String m=("шесть");
                    String n= ("шестьдесят");
                    System.out.println(x+" умножить на "+m+" равно "+n+" ");
                    break;
                case 6:
                    String o=("семь");
                    String p= ("семьдесят");
                    System.out.println(x+" умножить на "+o+" равно "+p+" ");
                    break;
                case 7:
                    String r=("восемь");
                    String s= ("восемьдесят");
                    System.out.println(x+" умножить на "+r+" равно "+s+" ");
                    break;
                case 8:
                    String t=("девять");
                    String u= ("девяносто");
                    System.out.println(x+" умножить на "+t+" равно "+u+" ");
                    break;
                case 9:
                    String t1=("десять");
                    String u1= ("сто");
                    System.out.println(x+" умножить на "+t1+" равно "+u1+" ");
                    break;
            }

        }
    }

}
