package by.it.sc02_morning.karenda.lesson03;

/*
напишите программу которая выводит на экран
TaskA1 world!

(строка должа быть одна, ошибки в тексте не допускаются)
Для ручной проверки запустите программу Ctrl+Shift+F10
Для автоматической проверки откройте и запустите класс Testing
*/

class TaskA1 {
    /*
    напишите программу которая выводит на экран
    TaskA1 world!

    (строка должа быть одна, ошибки в тексте не допускаются)
    Для ручной проверки запустите программу Ctrl+Shift+F10
    Для автоматической проверки откройте и запустите класс Testing
    */
    public static void main(String[] args) {

        System.out.println("TaskA1 World!");
    }
    }