package by.it.sc02_morning.serzhan.lesson06;
/*
Вывести на экран квадрат из 10х10 символов $.
После каждого символа нужно ставить пробел.
Нужно использовать всего ОДИН цикл while.
Разрешается использовать также опреатор if.
Буквы в каждой строке не разделять.

Пример вывода на экран:
$ $ $ $ $ $ $ $ $ $
$ $ $ $ $ $ $ $ $ $
$ $ $ $ $ $ $ $ $ $
$ $ $ $ $ $ $ $ $ $
$ $ $ $ $ $ $ $ $ $
$ $ $ $ $ $ $ $ $ $
$ $ $ $ $ $ $ $ $ $
$ $ $ $ $ $ $ $ $ $
$ $ $ $ $ $ $ $ $ $
$ $ $ $ $ $ $ $ $ $

*/

public class TaskA1 {
    public static void main(String[] args) {
        do
        {
            System.out.print("$ $ $ $ $ $ $ $ $ $ \n$ $ $ $ $ $ $ $ $ $ \n$ $ $ $ $ $ $ $ $ $ \n$ $ $ $ $ $ $ $ $ $ \n$ $ $ $ $ $ $ $ $ $ \n" +
                    "$ $ $ $ $ $ $ $ $ $ \n$ $ $ $ $ $ $ $ $ $ \n$ $ $ $ $ $ $ $ $ $ \n$ $ $ $ $ $ $ $ $ $ \n$ $ $ $ $ $ $ $ $ $ \n");
        } while (false);
    }
}