package by.it.sc02_morning.menchytsky.lesson05;

/*
Напишите программу которая спрашивает у пользователя:
Какую вы хотите зарплату в $$$?

После ввода суммы, программа анализирует полученное значение
и если введенная цифра меньше 300 или больше 3000 программа выводит на экран:
Мы вам перезвоним!

Иначе выводит в цикле по переменной int month от 0 до 14 рассчитанную зарплату.
В летние месяцы - выводится введенная сумма с названием месяца.
В несуществующие месяцы 0, 13 и 14 выводится сумма в $0.0
в остальные месяцы выводится указанная сумма с премией в 50%.

Сделайте так, чтобы в тот месяц, когда получилась зарплата в $666 цикл после вывода прерывался.

Пример работы программы (у вас должно быть так же, до символа):

Какую вы хотите зарплату в $$$?
2000
За месяц 0 начислено $0.0
За январь начислено $3000.0
За февраль начислено $3000.0
За март начислено $3000.0
За апрель начислено $3000.0
За май начислено $3000.0
За июнь начислено $2000.0
За июль начислено $2000.0
За август начислено $2000.0
За сентябрь начислено $3000.0
За октябрь начислено $3000.0
За ноябрь начислено $3000.0
За декабрь начислено $3000.0
За месяц 13 начислено $0.0
За месяц 14 начислено $0.0

*/

import java.util.Scanner;

public class TaskC1 {
    public static void main(String[] args) {
        System.out.println("Какую вы хотите зарплату в $$$?");
        Scanner sc=new Scanner(System.in);
        double sum = sc.nextInt();
        double zero = 0.0;
        double prize = sum + sum*0.5;
        if(sum < 300 || sum > 3000) System.out.println("Мы вам перезвоним!");
        else {
            for(int i=0 ; i<=14 ; i++){
                if(i==6) {
                    System.out.println("За июнь начислено $"+sum);
                    if(sum == 666) break;
                }
                else if(i==7) System.out.println("За июль начислено $"+sum);
                else if(i==8) System.out.println("За август начислено $"+sum);
                else if(i==0) System.out.println("За месяц "+i+" начислено $"+zero);
                else if(i==13) System.out.println("За месяц "+i+" начислено $"+zero);
                else if(i==14) System.out.println("За месяц "+i+" начислено $"+zero);
                else if(i==1) {
                    System.out.println("За январь начислено $"+prize);
                    if(prize == 666) break;
                }
                else if(i==2) System.out.println("За февраль начислено $"+prize);
                else if(i==3) System.out.println("За март начислено $"+prize);
                else if(i==4) System.out.println("За апрель начислено $"+prize);
                else if(i==5) System.out.println("За май начислено $"+prize);
                else if(i==9) System.out.println("За сентябрь начислено $"+prize);
                else if(i==10) System.out.println("За октябрь начислено $"+prize);
                else if(i==11) System.out.println("За ноябрь начислено $"+prize);
                else if(i==12) System.out.println("За декабрь начислено $"+prize);
            }
                }
            }
        }



