package by.it.akhmelev.lesson05;

/*
Вывести таблицу умножения 10 x 10, но словами
два умножить на два равно четыре
три умножить на два равно шесть
четрые умножить на два равно четыре
пять умножить на два равно четыре
два умножить на два равно четыре
два умножить на два равно четыре
два умножить на два равно четыре
два умножить на два равно четыре
....
девять умножить на восемь равно семьдесят два
девять умножить на девять равно восемьдесят один
девять умножить на десять равно девяносто
десять умножить на два равно двадцать
десять умножить на три равно тридцать
десять умножить на четыре равно сорок
десять умножить на пять равно пятьдесят
десять умножить на шесть равно шестьдесят
десять умножить на семь равно семьдесят
десять умножить на восемь равно восемьдесят
десять умножить на девять равно девяносто
десять умножить на десять равно сто


*/
public class TaskC3 {

}
