package by.it.sc03_evening_mon_fri.halaevanika.lesson06;

/*
Задача по алгоритмам
Написать программу, которая:
1. вводит с консоли число N, которое должно быть больше 0
2. потом вводит N чисел с консоли типа int
3. выводит на экран максимальное, минимальное и среднее арифметическое из введенных N чисел.


Требования:
1. Программа должна считывать числа с клавиатуры.
2. Программа должна выводить строку "Minimum = " минимальное число в формате int.
3. Программа должна выводить строку "Maximum = " максимальное число в формате int.
4. Программа должна выводить строку "Average = " среднее арифметическое в формате double.
 */


import java.util.Scanner;

public class TaskB3 {
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        int N = sc.nextInt();
        int n = sc.nextInt();
        int min= n;
        int max=n;
        double Average = n;
        int sum=n;
        for (int i = 0; i < N - 1; i++)
        {
            n = sc.nextInt();
            min = Math.min(min,n);
            max = Math.max(max,n);
            sum += n; Average = ((double)sum/N);
        } System.out.println("Minimum = " + min);
    System.out.println("Maximum = " + max);
    System.out.println("Average = " + Average); }
}
